import React from "react";
import { useState } from "react";
import "../../assets/css/ModalOne.css";
import Button from "react-bootstrap/Button";
import Modal from "react-bootstrap/Modal";
function ModalOne() {
  const [show, setShow] = useState(false);

  const handleClose = () => setShow(false);
  const handleShow = () => setShow(true);
  return (
    <>
      <Button className="nd-primary-btn " onClick={handleShow}>
        Know more
      </Button>
      <Modal show={show} onHide={handleClose} size="lg">
        <Modal.Header closeButton>
          <Modal.Title className="nd-modal-title">
            नंदा गौरा आवेदन पत्र ऑनलाइन भरने से पूर्व निम्न निर्देशों का
            भली-भाँति अध्ययन कर लें
          </Modal.Title>
        </Modal.Header>
        <Modal.Body className="nd-modal-body">
          <ol>
            <li>
              आवेदन फार्म में सभी जानकारी पूर्ण रूप से सही भरें, अधूरी एवं गलत
              जानकारी भरने पर आवेदन निरस्त कर दिया जाएगा।
            </li>
            <li>
              यह योजना केवल उत्तराखण्ड राज्य के मूल/स्थायी बालिकाओं हेतु ही
              मान्य है ।
            </li>
            <li>
              एक परिवार की किन्हीं भी दो से अधिक बालिकाओं(जीवित बालिकाओं) को
              नंदा गौरा योजना से लाभान्वित नहीं किया जाएगा।
            </li>
            <li>
              एक कन्या/बालिका के लिए एक चरण के लिए एक से अधिक बार योजना के लाभ
              हेतु आवेदन करने पर आवेदन पत्र निरस्त कर दिया जाएगा।
            </li>
            <li>
              इस योजना का लाभ केवल कन्या जन्म(प्रथम चरण ) पर एवं बालिका के इंटर
              (कक्षा-12) उत्तीर्ण (द्वितीय चरण) करने पर ही देय है।
            </li>
            <li>
              कन्या के जन्म पर लाभ हेतु कन्या-शिशु जन्म के 06 माह के भीतर आवेदन
              करना अनिवार्य है। 06 माह के उपरांत आवेदन करने पर आवेदन स्वीकार
              नहीं किया जाएगा।
            </li>
            <li>
              द्वितीय चरण के लाभ हेतु प्रत्येक वित्तीय-वर्ष में आवेदन करने की
              अंतिम तिथि 30 नवबंर निर्धारित की गयी हैं। इस तिथि के उपरांत आवेदन
              करने पर आवेदन स्वीकार नहीं किया जाएगा।
            </li>

            <li>
              प्रत्येक चरण हेतु आवश्यक प्रमाण पत्र नंदा गौरा योजना हेतु ऑनलाइन
              आवेदन करने के समय अपलोड करने आवश्यक है।
            </li>
            <li>
              कन्या के जन्म पर आवेदन हेतु माता / पिता / संरक्षक एवं कन्या शिशु
              के संयुक्त खाता संख्या एवं 12वी कक्षा उत्तीर्ण हेतु
              छात्रा/लाभार्थी का बैंक खाता विवरण सही से भरें। बैंक खाता विवरण
              भरते समय यह सुनिश्चित कर लें कि खाता आधार से लिंक हो साथ ही ध्यान
              दें कि खाता जन-धन का न हो।
            </li>
            <li>
              नंदा गौरा योजना का लाभ प्राप्त करने के लिए आवेदनकर्ता यह सुनिश्चित
              कर ले कि उनके द्वारा उपलब्ध करवाया गया बैंक खाता सक्रिय है।
            </li>
            <li>
              यह योजना बजट की प्रत्याशा में पहले आओ-पहले पाओ पर आधारित है।
            </li>
            <li>
              यह योजना पूरी तरह ऑनलाइन कर दी गयी है । किसी भी दशा में ऑफलाइन
              आवेदन स्वीकार नहीं किए जाएंगे।
            </li>
            <li>यह योजना समय-समय पर जारी शासनादेशो के अनुरूप संचालित होगी।</li>
          </ol>
        </Modal.Body>
        <Modal.Footer className="nd-footer">
          <Button className="nd-close-btn-new" onClick={handleClose}>
            Close
          </Button>
        </Modal.Footer>
      </Modal>
    </>
  );
}

export default ModalOne;
